function create_room(canvas_name,after_rigist){
	
	var can_room = document.getElementById(canvas_name);
  	var ctx_room = can_room.getContext('2d');	
  	
    //full size
    can_room.height = h;
    can_room.width = w;
	
	//create fon in the room
	var canvas_fon = this.__canvas = new fabric.StaticCanvas(canvas_name);
  	fabric.Object.prototype.transparentCorners = false;
  
	fabric.Image.fromURL('img/wfbg.png', function(img){
    img.scaleToWidth(550);
    var patternSourceCanvas = new fabric.StaticCanvas();
    patternSourceCanvas.add(img);
    var pattern = new fabric.Pattern({
      source: function() {
        patternSourceCanvas.setDimensions({
          width: img.getWidth(),
          height: img.getHeight()
        });
        return patternSourceCanvas.getElement();
      },
      repeat: 'repeat'
    });
    var rect = new fabric.Rect({ width: w, height: h, fill: pattern});
    canvas_fon.add(rect);
    if(canvas_fon.item(0) != undefined)
    	continue_draw();
    });
    //////
    
	function continue_draw(){

	//create element of person room


	var r_circle;
    if (w*0.28<h*0.46)
    	r_circle = w*0.07; else r_circle = h*0.115;




    //create rect in the center of window
	var rect_center_1 = new fabric.Rect({left: w*0.3,top: h*0.2,width: w*0.4,height: h*0.6, opacity: 0.3});
	var rect_center_2 = new fabric.Rect({left: w*0.7,top: h*0.51,width: w*0.165,height: h*0.02, opacity: 0.3});
	var rect_center_3 = new fabric.Rect({left: w*0.865,top: h*0.487,width: w*0.14,height: h*0.072, opacity: 0.3, rx:6, ry:6});
	canvas_fon.add(rect_center_1,rect_center_2,rect_center_3);

    //create fon rect
    var rect_fon_top = new fabric.Rect({left: w*0.3,top: 0,width: w*0.4,height: h, opacity: 0.1});
    canvas_fon.add(rect_fon_top)

	//create button from svg icon

	//help-button
	var path_question_1 = new fabric.Path('M15.873,5.96c-5.392,0-6.572,3.971-6.572,5.501c0,0.811,0.657,1.478,1.468,1.478c0.811,0,1.468-0.647,1.468-1.458c0.018-0.605,0.332-2.585,3.637-2.585c1.623,0,2.822,0.425,3.563,1.26c0.915,1.03,0.866,2.362,0.803,2.887c-0.188,1.559-1.054,2.35-2.575,2.35c-2.694,0-3.259,1.47-3.259,2.703v1.236c0,0.811,0.657,1.468,1.468,1.468c0.811,0,1.468-0.657,1.468-1.468v-0.993c0.085-0.006,0.192-0.011,0.323-0.011c2.367,0,5.053-1.296,5.49-4.936c0.233-1.941-0.321-3.831-1.522-5.185C20.723,7.182,18.986,5.96,15.873,5.96z');
	var path_question_2 = new fabric.Path('M15.873,22.251c-0.484,0-0.958,0.198-1.299,0.54c-0.341,0.341-0.536,0.814-0.536,1.298c0,0.481,0.194,0.955,0.536,1.296c0.345,0.342,0.818,0.539,1.299,0.539s0.954-0.197,1.299-0.539c0.342-0.341,0.536-0.814,0.536-1.296c0-0.483-0.194-0.957-0.536-1.298C16.827,22.449,16.357,22.251,15.873,22.251z');
	var path_question_3 = new fabric.Path('M16,0C7.178,0,0,7.178,0,16s7.178,16,16,16s16-7.178,16-16S24.822,0,16,0z M16,29.064C8.796,29.064,2.936,23.203,2.936,16C2.936,8.796,8.796,2.936,16,2.936S29.064,8.796,29.064,16C29.064,23.203,23.204,29.064,16,29.064z');
	var circle_question = new fabric.Circle({radius: 15, fill: '#474747', left: 1, top: 1});
	var circle_question_sh = new fabric.Circle({radius: 16, fill: 'black', left: 2, top: 2});
	path_question_1.set({fill: '#191919',});
	path_question_2.set({fill: '#191919',});
	path_question_3.set({fill: '#191919',});

	var group_question = new fabric.Group([circle_question_sh,circle_question,path_question_1,path_question_2,path_question_3], {
  		left: w*0.85,
 	 	top: h*0.25+r_circle*1.7 - r_circle*0.3
  		});
	group_question.set('scaleX', r_circle*0.6/33);
	group_question.set('scaleY', r_circle*0.6/33);
	canvas_fon.add(group_question);

	//achive button
	var path_achive_1 = new fabric.Path('M26.096,17.579c-3.111,0-5.642,2.53-5.642,5.642c0,3.113,2.53,5.643,5.642,5.643s5.643-2.528,5.643-5.643    C31.738,20.109,29.207,17.579,26.096,17.579z M28.339,26.34c0.024,0.091-0.008,0.188-0.084,0.243s-0.179,0.057-0.257,0.005    l-1.902-1.267l-1.902,1.267c-0.078,0.052-0.181,0.05-0.256-0.005c-0.076-0.057-0.111-0.152-0.084-0.243l0.616-2.198l-1.793-1.421    c-0.073-0.059-0.104-0.155-0.073-0.245c0.028-0.091,0.11-0.151,0.205-0.156l2.284-0.092l0.793-2.143    c0.033-0.088,0.117-0.146,0.211-0.146c0.095,0,0.179,0.06,0.212,0.146l0.791,2.143l2.284,0.092    c0.095,0.005,0.177,0.065,0.205,0.156c0.028,0.09,0,0.188-0.073,0.245l-1.794,1.421L28.339,26.34z');
	var path_achive_2 = new fabric.Path('M1.045,2.927C0.468,2.927,0,3.396,0,3.973v19.306c0,0.576,0.468,1.045,1.045,1.045h18.514    c-0.061-0.36-0.1-0.728-0.1-1.104c0-0.301,0.027-0.594,0.066-0.884H5.635c0-2.014-1.633-3.646-3.648-3.646V8.643    c2.015,0,3.648-1.634,3.648-3.648c0-0.027-0.005-0.052-0.006-0.08h20.49c-0.002,0.028-0.006,0.053-0.006,0.08    c0,2.015,1.633,3.648,3.647,3.648c0.015,0,0.027-0.003,0.042-0.004v9.08c0.809,0.547,1.485,1.271,1.987,2.11V3.973    c0-0.577-0.468-1.045-1.045-1.045H1.045z');
    var path_achive_3 = new fabric.Path('M7.718,18.57h13.649c0.744-0.756,1.669-1.334,2.703-1.668v-0.317H7.718V18.57z');
    var rect_achive_1 = new fabric.Rect({left: 7.718,top: 8.679,fill: '#191919',width: 16.353, height: 1.986});
    var rect_achive_2 = new fabric.Rect({left: 7.718,top: 12.632,fill: '#191919',width: 16.353, height: 1.986});
    var circle_achive = new fabric.Circle({radius: 24, fill: '#474747', left: -10, top: -12, stroke: '#191919',strokeWidth: 3});
    var circle_achive_sh = new fabric.Circle({radius: 25, fill: 'black', left: -8, top: -10});
    path_achive_1.set({fill: '#191919',});
	path_achive_2.set({fill: '#191919',});
	path_achive_3.set({fill: '#191919',});
	var group_achive = new fabric.Group([circle_achive_sh,circle_achive,path_achive_1,path_achive_2,path_achive_3,rect_achive_1,rect_achive_2], {
  		left: w*0.85+r_circle*1.3 - r_circle*0.7,
 	 	top: h*0.25+r_circle - r_circle*0.7
  		});
	group_achive.set('scaleX', r_circle*0.35/12);
	group_achive.set('scaleY', r_circle*0.35/12);
	canvas_fon.add(group_achive);

	//button site
	var path_site_1 = new fabric.Path('M299.736,352.75h-46.237v-45.32h46.237v-30H30v-214h352.996v120.2h23.909c2.104,0,4.146,0.285,6.091,0.81V53.43     c0-11.046-8.953-20-20-20H20c-11.047,0-20,8.954-20,20v234c0,11.046,8.953,20,20,20h139.498v45.32h-54.283     c-10.201,0-18.5,8.299-18.5,18.5s8.299,18.5,18.5,18.5h198.74c-2.655-3.792-4.221-8.401-4.221-13.372V352.75H299.736z');
	var path_site_2 = new fabric.Path('M354.998,146.368V91.36c0-2.761-2.238-5-5-5h-287c-2.762,0-5,2.239-5,5v55.009c0,2.761,2.238,5,5,5h287     C352.76,151.368,354.998,149.129,354.998,146.368z');
    var path_site_3 = new fabric.Path('M353.965,183.63v-9.409c0-2.19-1.774-3.966-3.967-3.966h-64.719c-2.189,0-3.967,1.775-3.967,3.966v76.333     c0,2.19,1.775,3.968,3.967,3.968h14.455V207c0-12.887,10.482-23.37,23.369-23.37H353.965L353.965,183.63z');
    var path_site_4 = new fabric.Path('M62.998,170.255c-2.189,0-3.967,1.775-3.967,3.966v76.333c0,2.19,1.777,3.968,3.967,3.968h188.781     c2.189,0,3.965-1.774,3.965-3.968v-76.333c0-2.19-1.773-3.966-3.965-3.966H62.998z');
    var path_site_5 = new fabric.Path('M409.81,193.63h-83.8c-7.372,0-13.37,5.998-13.37,13.37v169.378c0,7.372,5.998,13.371,13.37,13.371h83.8     c7.372,0,13.37-5.999,13.37-13.371V207C423.18,199.628,417.182,193.63,409.81,193.63z M367.91,380.156     c-3.141,0-5.686-2.544-5.686-5.683c0-3.138,2.545-5.683,5.686-5.683c3.137,0,5.682,2.545,5.682,5.683     C373.592,377.612,371.047,380.156,367.91,380.156z M414.266,362.455h-92.711V220.924h92.711V362.455z');
    var path_site_6 = new fabric.Path('M333.948,306.947h67.924c0.936,0,1.691-0.758,1.691-1.692v-27.13c0-0.938-0.758-1.692-1.691-1.692h-67.924     c-0.936,0-1.692,0.758-1.692,1.692v27.13C332.256,306.189,333.015,306.947,333.948,306.947z');
    var path_site_7 = new fabric.Path('M333.948,349.633h67.924c0.936,0,1.691-0.757,1.691-1.693v-27.129c0-0.938-0.758-1.695-1.691-1.695h-67.924     c-0.936,0-1.692,0.76-1.692,1.695v27.129C332.256,348.876,333.015,349.633,333.948,349.633z');
    var path_site_8 = new fabric.Path('M333.948,264.262h67.924c0.936,0,1.691-0.756,1.691-1.693v-27.129c0-0.937-0.758-1.692-1.691-1.692h-67.924     c-0.936,0-1.692,0.758-1.692,1.692v27.129C332.256,263.506,333.015,264.262,333.948,264.262z');
    var circle_site = new fabric.Circle({radius: 320, fill: '#474747', left: -125, top: -125, stroke: '#191919',strokeWidth: 35});
    var circle_site_sh = new fabric.Circle({radius: 330, fill: 'black', left: -98, top: -98});
    path_site_1.set({fill: '#191919',});
	path_site_2.set({fill: '#191919',});
	path_site_3.set({fill: '#191919',});
	path_site_4.set({fill: '#191919',});
	path_site_5.set({fill: '#191919',});
	path_site_6.set({fill: '#191919',});
	path_site_7.set({fill: '#191919',});
	path_site_8.set({fill: '#191919',});
	var group_achive = new fabric.Group([circle_site_sh,circle_site,path_site_1,path_site_2,path_site_3,path_site_4,path_site_5,path_site_6,path_site_7,path_site_8], {
  		left: w*0.85-r_circle*1.25 - r_circle*0.75, 
 	 	top: h*0.25-r_circle*1.25 - r_circle*0.75 
  		});
	group_achive.set('scaleX', r_circle*0.75/320);
	group_achive.set('scaleY', r_circle*0.75/320);
	canvas_fon.add(group_achive);

	//button omega
	var path_omega_1 = new fabric.Path('M4.293,5.898c0.812,0,1.472-0.659,1.472-1.471c0-0.81-0.659-1.467-1.472-1.467S2.82,3.618,2.82,4.427C2.82,5.239,3.48,5.898,4.293,5.898z M4.293,4.109c0.178,0,0.322,0.144,0.322,0.318c0,0.354-0.646,0.354-0.646,0C3.97,4.253,4.115,4.109,4.293,4.109z');
	var path_omega_2 = new fabric.Path('M31.426,0H0.574C0.26,0,0,0.259,0,0.574v30.852C0,31.742,0.26,32,0.574,32h30.852C31.743,32,32,31.742,32,31.425V0.574C32,0.259,31.743,0,31.426,0z M30.851,1.149V7.71H1.149V1.149H30.851z M1.149,30.852V8.858h29.701v21.994H1.149z');
	var path_omega_3 = new fabric.Path('M15.948,5.943c0.837,0,1.519-0.68,1.519-1.516c0-0.834-0.682-1.512-1.519-1.512c-0.835,0-1.513,0.678-1.513,1.512C14.436,5.263,15.113,5.943,15.948,5.943z M15.948,4.063c0.202,0,0.366,0.165,0.366,0.364c0,0.401-0.728,0.405-0.728,0C15.587,4.228,15.748,4.063,15.948,4.063z');
	var path_omega_4 = new fabric.Path('M4.692,11.733c-0.229-0.218-0.594-0.213-0.812,0.014c-0.22,0.229-0.214,0.592,0.014,0.811l3.575,3.447l-3.444,3.444c-0.224,0.224-0.224,0.588,0,0.812c0.115,0.112,0.261,0.168,0.408,0.168s0.292-0.056,0.404-0.168l4.269-4.27L4.692,11.733z');
	var path_omega_5 = new fabric.Path('M12.143,19.281H8.29c-0.317,0-0.574,0.258-0.574,0.574c0,0.315,0.257,0.574,0.574,0.574h3.853c0.312,0,0.571-0.258,0.571-0.574C12.714,19.539,12.454,19.281,12.143,19.281z');
	var path_omega_6 = new fabric.Path('M10.099,5.943c0.837,0,1.516-0.68,1.516-1.516c0-0.834-0.679-1.512-1.516-1.512c-0.835,0-1.513,0.678-1.513,1.512C8.586,5.263,9.264,5.943,10.099,5.943z M10.099,4.063c0.202,0,0.366,0.165,0.366,0.364c0,0.401-0.73,0.405-0.73,0C9.734,4.228,9.898,4.063,10.099,4.063z');
	var rect_omega = new fabric.Rect({left: -10,top: -5, rx: 3, ry: 3, fill: '#47A3FF',width: 50, height: 40, stroke: '#E0F0FF',strokeWidth: 2});
	var rect_omega_sh = new fabric.Rect({left: -8,top: -3, rx: 3, ry: 3, fill: '#143D66',width: 52, height: 42});
	path_omega_1.set({fill: '#E0F0FF',});
	path_omega_2.set({fill: '#E0F0FF',});
	path_omega_3.set({fill: '#E0F0FF',});
	path_omega_4.set({fill: '#E0F0FF',});
	path_omega_5.set({fill: '#E0F0FF',});
	path_omega_6.set({fill: '#E0F0FF',});
	var group_omega = new fabric.Group([rect_omega_sh,rect_omega,path_omega_1,path_omega_2,path_omega_3,path_omega_4,path_omega_5,path_omega_6], {
  		left: w*0.72, 
 	 	top: h*0.55
  		});
	group_omega.set('scaleX', w*0.07/50);
	group_omega.set('scaleY', w*0.07/50);
	canvas_fon.add(group_omega);

	//button shop
	var path_shop_1 = new fabric.Path('M444.09,93.103c-2.698-3.699-7.006-5.888-11.584-5.888H109.92c-0.625,0-1.249,0.038-1.85,0.119l-13.276-38.27   c-1.376-3.958-4.406-7.113-8.3-8.646L19.586,14.134c-7.374-2.887-15.695,0.735-18.591,8.1c-2.891,7.369,0.73,15.695,8.1,18.591   l60.768,23.872l74.381,214.399c-3.283,1.144-6.065,3.663-7.332,7.187l-21.506,59.739c-1.318,3.663-0.775,7.733,1.468,10.916   c2.24,3.183,5.883,5.078,9.773,5.078h11.044c-6.844,7.616-11.044,17.646-11.044,28.675c0,23.718,19.298,43.012,43.012,43.012   s43.012-19.294,43.012-43.012c0-11.029-4.2-21.059-11.044-28.675h93.776c-6.847,7.616-11.048,17.646-11.048,28.675   c0,23.718,19.294,43.012,43.013,43.012c23.718,0,43.012-19.294,43.012-43.012c0-11.029-4.2-21.059-11.043-28.675h13.433   c6.599,0,11.947-5.349,11.947-11.948c0-6.599-5.349-11.947-11.947-11.947H143.647l13.319-36.996   c1.72,0.724,3.578,1.152,5.523,1.152h210.278c6.234,0,11.751-4.027,13.65-9.959l59.739-186.387   C447.557,101.567,446.788,96.802,444.09,93.103z M169.659,409.807c-10.543,0-19.116-8.573-19.116-19.116   s8.573-19.117,19.116-19.117s19.116,8.574,19.116,19.117S180.202,409.807,169.659,409.807z M327.367,409.807   c-10.543,0-19.117-8.573-19.117-19.116s8.574-19.117,19.117-19.117c10.542,0,19.116,8.574,19.116,19.117   S337.909,409.807,327.367,409.807z M402.52,148.149h-73.161V115.89h83.499L402.52,148.149z M381.453,213.861h-52.094v-37.038   h63.967L381.453,213.861z M234.571,213.861v-37.038h66.113v37.038H234.571z M300.684,242.538v31.064h-66.113v-31.064H300.684z    M139.115,176.823h66.784v37.038h-53.933L139.115,176.823z M234.571,148.149V115.89h66.113v32.259H234.571z M205.898,115.89v32.259   h-76.734l-11.191-32.259H205.898z M161.916,242.538h43.982v31.064h-33.206L161.916,242.538z M329.359,273.603v-31.064h42.909   l-9.955,31.064H329.359z');
	var rect_shop = new fabric.Rect({left: -110,top: -50, rx: 80, ry: 80, fill: '#474747',width: 700, height: 500, stroke: '#191919',strokeWidth: 35});
	var rect_shop_sh = new fabric.Rect({left: -100,top: -40, rx: 80, ry: 80, fill: 'black',width: 745, height: 545});
	path_shop_1.set({fill: '#191919',});
	var group_shop = new fabric.Group([rect_shop_sh,rect_shop,path_shop_1], {
  		left: w*0.305, 
 	 	top: h*0.805
  		});
	group_shop.set('scaleX', w*0.03/446);
	group_shop.set('scaleY', w*0.03/446);
	canvas_fon.add(group_shop);

	//button custom
	var path_custom_1 = new fabric.Path('M479.165,406.394l0.324-0.194L309.403,235.424l77.202-77.202l68.962-44.436l27.416-49.289l-31.86-31.903l-49.289,27.46l-44.479,68.94l-77.116,77.137l-76.512-76.835l-0.345-101.491L99.649,0L88.54,11.023l55.178,55.113L89.92,120.041L34.785,64.95l-11.109,10.98l27.848,103.755l98.708,0.259l-0.604,0.647l77.957,78.28l-28.819,28.84l-18.918-18.874l-29.164,29.185l9.06,9.017c-26.208,10.03-98.514,82.357-108.566,108.523l-9.017-9.038l-29.121,29.185l66.956,66.956l29.185-29.207l-9.103-9.06c26.209-9.966,98.557-82.336,108.566-108.501l9.038,9.081l29.164-29.207l-18.874-18.896l28.754-28.754l169.999,170.668l0.302-0.216c14.496,14.021,37.619,14.043,51.791-0.28C493.143,444.035,493.186,420.954,479.165,406.394z M465.166,444.552c-6.385,6.385-16.696,6.45-23.145,0c-6.277-6.385-6.385-16.631-0.043-23.102c6.493-6.385,16.761-6.385,23.189,0C471.615,427.813,471.615,438.124,465.166,444.552z');
	var rect_custom = new fabric.Rect({left: -140,top: -55, rx: 80, ry: 80, fill: '#474747',width: 700, height: 500, stroke: '#191919',strokeWidth: 35});
	var rect_custom_sh = new fabric.Rect({left: -130,top: -45, rx: 80, ry: 80, fill: 'black',width: 745, height: 545});
	path_custom_1.set({fill: '#191919',});
	path_custom_1.set('scaleX', 0.85);
	path_custom_1.set('scaleY', 0.85);
	var group_custom = new fabric.Group([rect_custom_sh,rect_custom,path_custom_1], {
  		left:w*0.365,
 	 	top: h*0.805
  		});
	group_custom.set('scaleX', w*0.03/446);
	group_custom.set('scaleY', w*0.03/446);
	canvas_fon.add(group_custom);

	//button expand
	var path_expand_1 = new fabric.Path('M12,0.001L3,0C2.199,0,1.445,0.312,0.879,0.879C0.312,1.445,0,2.199,0,3v9.001c0,1.653,1.346,3,3,3s3-1.346,3-3v-1.639l3.879,3.759c1.132,1.132,3.108,1.134,4.242,0c1.17-1.17,1.17-3.072,0.011-4.232l-3.77-3.888H12c1.654,0,3-1.346,3-3S13.654,0.001,12,0.001z M12,4.001H8c-0.401,0-0.765,0.24-0.921,0.61C6.923,4.98,7.003,5.408,7.282,5.697l5.425,5.596c0.39,0.39,0.39,1.024,0,1.414c-0.377,0.379-1.027,0.389-1.425-0.011L5.696,7.282C5.407,7.003,4.979,6.923,4.61,7.08C4.24,7.237,4,7.6,4,8.001v4c0,0.551-0.448,1-1,1c-0.552-0.001-1-0.449-1-1V3c0-0.267,0.104-0.518,0.293-0.707C2.482,2.104,2.733,2,3,2l9,0.001c0.552,0,1,0.448,1,1C13,3.552,12.552,4.001,12,4.001z M31.121,0.879C30.555,0.312,29.801,0,29,0l-9,0.001c-1.654,0-3,1.346-3,3s1.346,3,3,3h1.638l-3.759,3.877c-1.17,1.171-1.17,3.073,0,4.244c1.134,1.133,3.121,1.12,4.231,0.011L26,10.362v1.639c0,1.654,1.346,3,3,3s3-1.347,3-3V3C32,2.199,31.688,1.445,31.121,0.879z M30,12.001c0,0.551-0.448,0.999-1,1c-0.552,0-1-0.449-1-1v-4c0-0.401-0.24-0.764-0.61-0.921C27.264,7.027,27.132,7.001,27,7.001c-0.255,0-0.506,0.098-0.696,0.281l-5.597,5.425c-0.377,0.378-1.036,0.378-1.414,0c-0.39-0.39-0.39-1.024,0.011-1.425l5.414-5.585c0.279-0.289,0.359-0.717,0.203-1.086c-0.156-0.37-0.52-0.61-0.921-0.61h-4c-0.552,0-1-0.449-1-1c0-0.552,0.448-1,1-1L29,2c0.267,0,0.518,0.104,0.707,0.293C29.896,2.482,30,2.733,30,3V12.001z M29,17.001c-1.654,0-3,1.346-3,3v1.639l-3.878-3.758c-1.133-1.135-3.11-1.134-4.243-0.001c-1.17,1.17-1.17,3.073-0.011,4.232l3.77,3.888H20c-1.654,0-3,1.346-3,3s1.346,3,3,3l9,0.001c0.801,0,1.555-0.312,2.121-0.879S32,29.803,32,29.002v-9.001C32,18.348,30.654,17.002,29,17.001z M30,29.002c0,0.267-0.104,0.519-0.293,0.707c-0.189,0.188-0.44,0.293-0.707,0.293l-9-0.001c-0.552,0-1-0.448-1-1c0-0.551,0.448-1,1-1h4c0.401,0,0.765-0.24,0.921-0.61c0.156-0.369,0.076-0.797-0.203-1.086l-5.425-5.596c-0.39-0.39-0.39-1.023,0-1.413c0.376-0.377,1.025-0.392,1.425,0.01l5.586,5.414c0.289,0.278,0.716,0.357,1.086,0.202c0.37-0.157,0.61-0.52,0.61-0.921v-4c0-0.552,0.448-1,1-1c0.551,0,1,0.448,1,1V29.002z M12,26.001h-1.638l3.759-3.877c1.17-1.17,1.17-3.073,0-4.244c-1.133-1.131-3.12-1.12-4.231-0.01L6,21.64v-1.639c0-1.654-1.346-3-3-3c-1.654,0.001-3,1.347-3,3v9.001c0,0.801,0.312,1.555,0.879,2.121S2.199,32.002,3,32.002l9-0.001c1.654,0,3-1.346,3-3S13.654,26.001,12,26.001z M12,30.001l-9,0.001c-0.267,0-0.518-0.104-0.707-0.293C2.104,29.521,2,29.269,2,29.002v-9.001c0-0.552,0.449-1,1-1c0.552,0,1,0.448,1,1v4c0,0.401,0.24,0.764,0.61,0.921c0.369,0.155,0.797,0.076,1.086-0.202l5.597-5.424c0.377-0.379,1.037-0.378,1.414-0.001c0.39,0.391,0.39,1.024-0.011,1.425l-5.414,5.585c-0.279,0.289-0.359,0.717-0.203,1.086c0.156,0.37,0.52,0.61,0.921,0.61h4c0.552,0,1,0.449,1,1C13,29.553,12.552,30.001,12,30.001z');
	var rect_expand = new fabric.Rect({left: -8,top: -8, rx: 10, ry: 10, fill: '#474747',width: 45, height: 45, stroke: '#191919',strokeWidth: 3});
	var rect_expand_sh = new fabric.Rect({left: -6.5,top: -6.5, rx: 10, ry: 10, fill: 'black',width: 48, height: 48});
	path_expand_1.set({fill: '#191919',});
	var group_expand = new fabric.Group([rect_expand_sh,rect_expand,path_expand_1], {
  		left: w*0.658, 
 	 	top: h*0.805
  		});
	group_expand.set('scaleX', w*0.03/40);
	group_expand.set('scaleY', w*0.03/40);
	canvas_fon.add(group_expand);

	//button music
	var path_music_1 = new fabric.Path('M20,31.476v-4.21c4.649-1.651,8-6.046,8-11.266c0-5.216-3.351-9.612-8-11.265V0.524C26.896,2.304,32,8.548,32,16C32,23.454,26.896,29.698,20,31.476z M6,24c-3.313,0-6-2.688-6-6v-4c0-3.313,2.687-6,6-6h2l10-8v32L8,24H6z M14,24v-6v-4V8l-4,4H6c-1.106,0-2,0.896-2,2v4c0,1.106,0.894,2,2,2h4L14,24z M26,16c0,3.722-2.554,6.824-6,7.716v-4.27c1.192-0.694,2-1.971,2-3.446s-0.808-2.752-2-3.446v-4.27C23.446,9.174,26,12.276,26,16z');
	var rect_music = new fabric.Rect({left: -8,top: -8, rx: 10, ry: 10, fill: '#474747',width: 45, height: 45, stroke: '#191919',strokeWidth: 3});
	var rect_music_sh = new fabric.Rect({left: -6.5,top: -6.5, rx: 10, ry: 10, fill: 'black',width: 48, height: 48});
	path_music_1.set({fill: '#191919',});
	path_music_1.set('opacity', 0.9);
	var group_music = new fabric.Group([rect_music_sh,rect_music,path_music_1], {
  		left: w*0.615, 
 	 	top: h*0.805
  		});
	group_music.set('scaleX', w*0.03/40);
	group_music.set('scaleY', w*0.03/40);
	canvas_fon.add(group_music);

	//create side plates
	var plate_1 = new fabric.Rect({rx: 5, ry: 5,left: 0,top: 0,width: w*0.2,height: h*0.15, opacity: 1});
	var plate_2 = new fabric.Rect({rx: 5, ry: 5,left: 0,top: 0,width: w*0.2,height: h*0.15, opacity: 1});
	var plate_3 = new fabric.Rect({rx: 5, ry: 5,left: 0,top: 0,width: w*0.2,height: h*0.15, opacity: 1});
	var plate_1_sh = new fabric.Rect({rx: 5, ry: 5,left: 1,top: 1,fill: 'black',width: w*0.2+2,height: h*0.15+2});
	var plate_2_sh = new fabric.Rect({rx: 5, ry: 5,left: 1,top: 1,fill: 'black',width: w*0.2+2,height: h*0.15+2});
	var plate_3_sh = new fabric.Rect({rx: 5, ry: 5,left: 1,top: 1,fill: 'black',width: w*0.2+2,height: h*0.15+2});
	var text_plate_1 = new fabric.Text('Теория', {fontSize: 30*((h*0.04)/30),originX: 'center',originY: 'center', left: w*0.1, top: h*0.075, fill: '#262626',fontWeight: 'bold'});
	var text_plate_2 = new fabric.Text('История', {fontSize: 30*((h*0.04)/30),originX: 'center',originY: 'center', left: w*0.1, top: h*0.075, fill: '#262626',fontWeight: 'bold'});
	var text_plate_3 = new fabric.Text('Новости галактики', {fontSize: 30*((h*0.04)/30),originX: 'center',originY: 'center', left: w*0.1, top: h*0.075, fill: '#262626',fontWeight: 'bold'});
	plate_1.setGradient('fill', {
  		x1: -1,
  		y1: h*0.21,
  		x2: w*0.2,
  		y2: h*0.21,
  		colorStops: {
    	0: 'F44951',
    	1: 'F44951'}
    });
    plate_2.setGradient('fill', {
  		x1: -1,
  		y1: h*0.21,
  		x2: w*0.2,
  		y2: h*0.21,
  		colorStops: {
    		0: '#2270C2',
    		1: '#2270C2'}
    });
    plate_3.setGradient('fill', {
  		x1: -1,
  		y1: h*0.21,
  		x2: w*0.2,
  		y2: h*0.21,
  		colorStops: {
    	0: '#F3CB81',
    	1: '#F3CB81'}
    });
    var group_plate_1 = new fabric.Group([plate_1_sh, plate_1, text_plate_1], {left: -1,top: h*0.21});
    var group_plate_2 = new fabric.Group([plate_2_sh, plate_2, text_plate_2], {left: -1,top: h*0.4});
    var group_plate_3 = new fabric.Group([plate_3_sh, plate_3, text_plate_3], {left: -1,top: h*0.59});
	canvas_fon.add(group_plate_1,group_plate_2,group_plate_3);

	//create top message place
	var mess_place_1 = new fabric.Rect({rx: 15, ry: 15,left: w*0.02,top: -15,width: w*0.5,height: h*0.19, opacity: 0.5});
	var mess_place_2 = new fabric.Rect({rx: 15, ry: 15,left: w*0.54,top: -15,width: w*0.16,height: h*0.105, opacity: 0.5});
	canvas_fon.add(mess_place_1,mess_place_2);


	//create unit with quote
	var rect_quote_1 = new fabric.Rect({rx: 10, ry: 10,left: -20,top: -150,width: 450,height: 600, opacity: 1, fill: '#B2B2B2', stroke: '#171717',strokeWidth: 5});
	var rect_quote_sh = new fabric.Rect({rx: 10, ry: 10,left: -5,top: -135,width: 455,height: 605, opacity: 1, fill: 'black',});
	var rect_quote_2 = new fabric.Rect({rx: 4, ry: 4,left: -70,top: 350,width: 4600,height: 400, opacity: 1, fill: '#E6E6E6',});
	var rect_quote_2_sh = new fabric.Rect({rx: 4, ry: 4,left: -65,top: 355,width: 4607,height: 407, opacity: 1, fill: 'black',});
	var text_quote = new fabric.Text('Программирование сегодня — это гонка разработчиков программ, стремящихся писать программы больше и с лучшей\nидиотоустойчивостью, и вселенной, которая пытается создавать больших и лучших идиотов. Пока вселенная побеждает.\n                                                                                                                                                                                           — Rick Cook', {fontSize: 80,left: -20,top: 480, fill: '#262626',fontWeight: 'bold',fontStyle: 'italic', fontFamily: 'Delicious',textAlign: 'left',  lineHeight: 0.9});
	var path_quote_1 = new fabric.Path('M204.583,216.671c50.664,0,91.74-48.075,91.74-107.378c0-82.237-41.074-107.377-91.74-107.377    c-50.668,0-91.74,25.14-91.74,107.377C112.844,168.596,153.916,216.671,204.583,216.671z');
	var path_quote_2 = new fabric.Path('M407.164,374.717L360.88,270.454c-2.117-4.771-5.836-8.728-10.465-11.138l-71.83-37.392    c-1.584-0.823-3.502-0.663-4.926,0.415c-20.316,15.366-44.203,23.488-69.076,23.488c-24.877,0-48.762-8.122-69.078-23.488    c-1.428-1.078-3.346-1.238-4.93-0.415L58.75,259.316c-4.631,2.41-8.346,6.365-10.465,11.138L2.001,374.717    c-3.191,7.188-2.537,15.412,1.75,22.005c4.285,6.592,11.537,10.526,19.4,10.526h362.861c7.863,0,15.117-3.936,19.402-10.527    C409.699,390.129,410.355,381.902,407.164,374.717z');
	path_quote_1.set('fill', '#333333');
	path_quote_2.set('fill', '#333333');
	var group_quote = new fabric.Group([rect_quote_sh,rect_quote_2_sh,rect_quote_2,rect_quote_1, path_quote_1, path_quote_2,text_quote], {left: w*0.01, top: h*0.996 - 912.5*(w*0.3/2305)});
	group_quote.set('scaleX', w*0.3/2305);
	group_quote.set('scaleY', w*0.3/2305);
	canvas_fon.add(group_quote);

	//fon for user-bar
	var path_user = new fabric.Path('M562.586,934.569h-213.49c0,0-351.178-54.969-347.428-114.969c51.25-26.25,292.5-91.25,306.25-97.5l1.25-45l18.75-5c0,0,7.5-70,7.5-81.25c0,0-28.75-56.25-35-88.75c0,0-23.75,0-26.25-23.75c-3.75-25,0-41.25-6.25-60c-3.75-17.5,10-36.25,21.25-32.5c0,0-25-128.75,0-163.75c17.5-25,71.25-88.75,197.5-111.25c0,0,31.25-3.75,41.25,1.25c7.5,2.5,6.25,5-8.75,21.25c0,0,65,40,86.25,103.75c12.5,40,7.5,126.25,0,148.75c0,0,18.75-3.75,16.25,20c-3.75,38.75-5,110-32.5,96.25c0,0-1.25,80-25,96.25c0,0-7.5,62.5,3.75,65h16.25c0,0,6.25,51.25,18.75,65c0,0,267.5,68.75,293.75,98.75C897.917,859.6,562.586,934.569,562.586,934.569z');
	path_user.set('scaleX', 1.5*r_circle/897);
	path_user.set('scaleY', 1.5*r_circle/897);
	path_user.set('top', h*0.25 + 0.4*r_circle);
	path_user.set('left', w*0.85-1.75*r_circle);
	var rect_user_fon = new fabric.Rect({rx: 10, ry: 10, left: w*0.85-1.5*r_circle, top: h*0.25 + 1.6*r_circle, width: r_circle, height: r_circle*0.2, fill: '#000000'});
	canvas_fon.add(path_user,rect_user_fon);

	//create advice text blok
	var fig_advice_omega = new fabric.Polygon([
      {x: 10, y: 0},
      {x: 125, y: 0},
      {x: 125, y: 100},
      {x: 160, y: 133},
      {x: 450, y: 133},
      {x: 450, y: 270},
      {x: 0, y: 270},
      {x: 0, y: 110},
      {x: 10, y: 100} ],
      {
        left: 0,
        top: 0,
        fill: '#85D6FF',
        stroke: 'grey',
        opacity: 0.5,
      });
	var fig_advice_omega_sh = new fabric.Polygon([{x: 10, y: 0},{x: 125, y: 0},{x: 125, y: 100},{x: 160, y: 133},{x: 450, y: 133},{x: 450, y: 270},{x: 0, y: 270},{x: 0, y: 110},{x: 10, y: 100} ],
      {
        left: 5,
        top: 5,
        fill: 'black',
        stroke: 'black',
        opacity: 0.7,
      });
	var fig_advice_creater = new fabric.Polygon([
      {x: 270-10, y: 0},
      {x: 270-125, y: 0},
      {x: 270-125, y: 100},
      {x: 270-160, y: 133},
      {x: 270-450, y: 133},
      {x: 270-450, y: 270},
      {x: 270-0, y: 270},
      {x: 270-0, y: 110},
      {x: 270-10, y: 100} ],
      {
        left: 0,
        top: 0,
        fill: '#FF5050',
        stroke: 'grey',
      });
	var fig_advice_creater_sh = new fabric.Polygon([{x: 270-10, y: 0},{x: 270-125, y: 0},{x: 270-125, y: 100},{x: 270-160, y: 133},{x: 270-450, y: 133},{x: 270-450, y: 270},{x: 270-0, y: 270},{x: 270-0, y: 110},{x: 270-10, y: 100} ],
      {
        left: 5,
        top: 5,
        fill: 'black',
        stroke: 'black',
      });
	var m_advice = (w+h)*0.09/270;
	var rect_advice_1 = new fabric.Rect({left: 14,top: 4,width: 107,height: 125, fill: '#FFFFFF', opacity: 0.7});
	var rect_advice_2 = new fabric.Rect({left: 330,top: 4,width: 107,height: 125, fill: '#FFFFFF', opacity: 1});
	var group_advice = new fabric.Group([fig_advice_omega_sh,fig_advice_creater_sh,fig_advice_omega,fig_advice_creater,rect_advice_1,rect_advice_2], {
		left: w*0.7 +  (w*0.3 - 456*m_advice)/2,
		top: h*0.997 - 276*m_advice});
	group_advice.set('scaleX', m_advice);
	group_advice.set('scaleY', m_advice);
	canvas_fon.add(group_advice);

	//button vkontakte
	var path_vkontakte = new fabric.Path('M53.174,52.908c-1.539-0.896-3.678-0.896-5.416-0.896h-5.707v11.76h5.238c1.939,0,4.412,0.139,6.084-1.035c1.535-1.033,2.404-3.061,2.404-4.992C55.777,55.951,54.709,53.805,53.174,52.908z M51.021,42.865c1.27-0.967,1.936-2.691,1.936-4.279c0-1.725-0.801-3.381-2.27-4.277c-1.537-0.896-4.346-0.689-6.15-0.689h-2.486v10.35h3.289C47.211,43.969,49.418,44.107,51.021,42.865z M79.125,0H16.873C7.555,0,0,7.555,0,16.875v62.25C0,88.443,7.555,96,16.873,96h62.252C88.443,96,96,88.443,96,79.125v-62.25C96,7.555,88.443,0,79.125,0z M50.604,72.535H30.992V25.201H52.42c6.207,0,11.934,3.951,11.934,10.92c0,5.381-3.004,9.066-6.836,10.211v0.139c5.682,1.174,9.74,4.26,9.74,11.705C67.258,65.066,62.566,72.535,50.604,72.535z');
	path_vkontakte.set({fill: '#2E2E2E',});
	var rect_vkontakte_sh = new fabric.Rect({left: 8,top: 8,width: 95,height: 95, fill: 'black', rx: 15, ry:15});
	var group_vkontakte = new fabric.Group([rect_vkontakte_sh,path_vkontakte], {
  		left: w*0.55, 
 	 	top: h*0.01
  		});
	group_vkontakte.set('scaleX', (h+w)*0.02/96);
	group_vkontakte.set('scaleY', (h+w)*0.02/96);
	canvas_fon.add(group_vkontakte);

	//button youTube
	var path_youTube = new fabric.Path('M16.281,0.001H1.855C0.831,0.001,0,0.83,0,1.855v14.426c0,1.025,0.831,1.854,1.855,1.854h14.426c1.024,0,1.855-0.828,1.855-1.854V1.855C18.136,0.83,17.306,0.001,16.281,0.001z M10.447,3.063h0.883v2.785c0,0.535,0.017,0.519,0.035,0.586c0.019,0.071,0.083,0.238,0.29,0.238c0.22,0,0.281-0.176,0.298-0.251c0.014-0.065,0.03-0.052,0.03-0.61V3.063h0.882v4.18h-0.894l0.011-0.211L11.71,6.919c-0.069,0.14-0.149,0.24-0.247,0.31c-0.099,0.069-0.21,0.104-0.342,0.104c-0.152,0-0.276-0.033-0.37-0.098c-0.092-0.063-0.156-0.141-0.198-0.24c-0.046-0.11-0.075-0.229-0.086-0.346c-0.013-0.135-0.02-0.414-0.02-0.83V3.063L10.447,3.063z M7.379,4.801c0-0.436,0.037-0.773,0.107-1.012C7.552,3.568,7.669,3.394,7.844,3.26c0.178-0.139,0.413-0.208,0.699-0.208c0.244,0,0.453,0.048,0.624,0.138c0.166,0.088,0.294,0.203,0.381,0.338C9.637,3.67,9.699,3.815,9.732,3.961c0.034,0.152,0.051,0.398,0.051,0.73v0.736c0,0.432-0.017,0.747-0.048,0.941C9.705,6.546,9.639,6.716,9.54,6.872C9.441,7.025,9.318,7.139,9.161,7.213C8.999,7.29,8.808,7.33,8.594,7.33c-0.244,0-0.451-0.034-0.617-0.104C7.823,7.164,7.705,7.074,7.623,6.953C7.539,6.827,7.477,6.672,7.44,6.492C7.4,6.298,7.38,5.996,7.38,5.593L7.379,4.801z M5.314,1.574l0.718,2.311c0.125-0.604,0.367-1.44,0.559-2.311h0.651L6.404,4.871L6.398,4.897v2.344H5.635V4.897L5.629,4.872L4.663,1.574H5.314z M15.708,14.501c-0.114,1.04-1.037,1.892-2.072,1.962c-3.048,0.131-6.087,0.131-9.134,0c-1.036-0.07-1.958-0.922-2.073-1.962c-0.113-1.646-0.113-3.263,0-4.907c0.114-1.04,1.037-1.89,2.073-1.963c3.047-0.13,6.086-0.13,9.134,0c1.036,0.073,1.958,0.923,2.072,1.963C15.822,11.238,15.822,12.855,15.708,14.501z M8.581,6.83c0.128,0,0.228-0.077,0.273-0.21C8.875,6.559,8.9,6.443,8.9,6.127V4.316c0-0.366-0.021-0.484-0.043-0.551C8.812,3.629,8.713,3.55,8.584,3.55c-0.127,0-0.227,0.076-0.274,0.211C8.286,3.826,8.262,3.947,8.262,4.316v1.761c0,0.346,0.025,0.465,0.047,0.532C8.355,6.749,8.454,6.83,8.581,6.83z M3.617,9.91h0.72H4.48v0.147v4.704h0.904v-4.704V9.91h0.142h0.723V8.99H3.617V9.91z M7.892,13.105c0,0.521-0.015,0.65-0.027,0.705c-0.031,0.135-0.139,0.217-0.291,0.217c-0.145,0-0.25-0.078-0.284-0.207c-0.015-0.055-0.031-0.184-0.031-0.68v-2.757H6.403v3.004c0,0.396,0.006,0.66,0.018,0.79c0.012,0.119,0.043,0.237,0.091,0.348c0.043,0.1,0.108,0.177,0.199,0.236c0.088,0.061,0.205,0.09,0.346,0.09c0.121,0,0.226-0.031,0.318-0.094c0.095-0.064,0.178-0.166,0.246-0.301l0.271,0.066L7.88,14.766h0.868v-4.383H7.893L7.892,13.105z M11.678,10.605c-0.047-0.093-0.115-0.162-0.205-0.215c-0.093-0.053-0.207-0.078-0.338-0.078c-0.11,0-0.209,0.027-0.304,0.086c-0.097,0.062-0.188,0.153-0.27,0.281L10.3,11.082v-0.486V8.991H9.444v5.771h0.808l0.05-0.257l0.07-0.358l0.19,0.308c0.084,0.138,0.177,0.239,0.275,0.306c0.093,0.062,0.19,0.094,0.296,0.094c0.15,0,0.276-0.053,0.386-0.156c0.115-0.112,0.186-0.237,0.217-0.389c0.034-0.168,0.051-0.434,0.051-0.416v-2.291c0,0.01,0.034-0.228-0.017-0.701C11.761,10.803,11.73,10.706,11.678,10.605z M10.933,13.148c0,0.41-0.021,0.535-0.038,0.6c-0.04,0.141-0.141,0.223-0.277,0.223c-0.132,0-0.233-0.078-0.275-0.215c-0.02-0.062-0.042-0.184-0.042-0.559v-1.161c0-0.39,0.02-0.507,0.038-0.563c0.039-0.129,0.141-0.207,0.272-0.207c0.135,0,0.237,0.082,0.28,0.221c0.019,0.061,0.044,0.183,0.044,0.551v1.111L10.933,13.148L10.933,13.148z M13.272,12.702h0.143h1.335v-0.476c0-0.431-0.04-0.925-0.119-1.156c-0.075-0.223-0.202-0.395-0.389-0.528c-0.181-0.128-0.419-0.195-0.706-0.195c-0.233,0-0.441,0.054-0.618,0.163s-0.3,0.262-0.378,0.469c-0.082,0.215-0.125,0.521-0.125,1.064v1.345c0,0.173,0.02,0.429,0.056,0.597c0.036,0.162,0.101,0.312,0.193,0.447c0.087,0.127,0.214,0.23,0.374,0.305c0.164,0.076,0.358,0.115,0.576,0.115c0.223,0,0.409-0.039,0.551-0.113c0.142-0.075,0.26-0.19,0.354-0.342c0.098-0.158,0.161-0.309,0.187-0.445c0.028-0.143,0.042-0.355,0.042-0.631v-0.205h-0.796v0.472c0,0.25-0.017,0.413-0.052,0.511c-0.049,0.133-0.162,0.211-0.309,0.211c-0.129,0-0.229-0.064-0.274-0.179c-0.022-0.054-0.047-0.151-0.047-0.452v-0.838v-0.138h0.002L13.272,12.702z M13.272,12.087v-0.495c0-0.364,0.019-0.309,0.035-0.358c0.038-0.117,0.141-0.186,0.284-0.186c0.128,0,0.226,0.075,0.265,0.203c0.016,0.052,0.036,0.002,0.036,0.341v0.495v0.139h-0.143h-0.333h-0.143C13.273,12.226,13.272,12.087,13.272,12.087z');
	path_youTube.set({fill: '#2E2E2E',});
	var rect_youTube_sh = new fabric.Rect({left: 0.5,top: 0.5,width: 19,height: 19, fill: 'black', rx: 3, ry:3});
	var group_youTube = new fabric.Group([rect_youTube_sh,path_youTube], {
  		left: w*0.6585, 
 	 	top: h*0.01
  		});
	group_youTube.set('scaleX', (h+w)*0.02/18.5);
	group_youTube.set('scaleY', (h+w)*0.02/18.5);
	canvas_fon.add(group_youTube);

	//button friend
	var path_friend = new fabric.Path('M147.128,91.076c0-37.95,30.766-68.716,68.721-68.716c37.95,0,68.719,30.766,68.719,68.716s-30.769,68.715-68.719,68.715C177.894,159.792,147.128,129.026,147.128,91.076z M248.873,206.607c0.689-14.963,5.84-28.812,14.127-40.261c-5.816-1.218-11.827-1.865-17.995-1.865h-58.304c-6.15,0-12.153,0.642-17.939,1.845c8.819,12.232,14.094,27.171,14.18,43.343c10.72-5.896,23.02-9.253,36.085-9.253C229.625,200.416,239.714,202.624,248.873,206.607z M260.505,212.775c19.96,12.517,33.957,33.688,36.517,58.274c8.133,3.801,17.171,5.994,26.746,5.994c34.968,0,63.311-28.346,63.311-63.313c0-34.971-28.343-63.311-63.311-63.311C289.12,150.42,261.031,178.257,260.505,212.775z M219.026,342.411c34.962,0,63.307-28.354,63.307-63.311c0-34.962-28.345-63.311-63.307-63.311c-34.965,0-63.322,28.348-63.322,63.311C155.705,314.057,184.061,342.411,219.026,342.411z M245.882,346.72h-53.717c-44.697,0-81.069,36.369-81.069,81.072v65.703l0.171,1.029l4.522,1.406c42.658,13.323,79.718,17.779,110.224,17.779c59.571,0,94.114-16.987,96.242-18.074l4.231-2.141h0.449v-65.703C326.936,383.089,290.585,346.72,245.882,346.72z M350.638,281.364h-53.314c-0.579,21.332-9.683,40.542-24.081,54.35c39.732,11.815,68.802,48.657,68.802,92.178v20.245c52.629-1.938,82.963-16.846,84.961-17.851l4.232-2.152h0.449v-65.715C431.693,317.728,395.324,281.364,350.638,281.364z M364.889,149.069c19.961,12.519,33.957,33.691,36.511,58.277c8.134,3.801,17.171,5.99,26.746,5.99c34.975,0,63.316-28.342,63.316-63.304c0-34.972-28.342-63.311-63.316-63.311C393.503,86.717,365.416,114.56,364.889,149.069z M455.01,217.658h-53.303c-0.579,21.332-9.682,40.542-24.08,54.349c39.731,11.811,68.801,48.658,68.801,92.179v20.245c52.624-1.934,82.964-16.84,84.962-17.852l4.226-2.145h0.455v-65.723C536.077,254.024,499.708,217.658,455.01,217.658z M107.937,277.044c12.386,0,23.903-3.618,33.67-9.777c3.106-20.241,13.958-37.932,29.454-49.975c0.065-1.188,0.174-2.361,0.174-3.561c0-34.971-28.351-63.311-63.298-63.311c-34.977,0-63.316,28.339-63.316,63.311C44.621,248.704,72.959,277.044,107.937,277.044z M164.795,335.714c-14.331-13.742-23.404-32.847-24.072-54.055c-1.971-0.147-3.928-0.295-5.943-0.295H81.069C36.366,281.364,0,317.728,0,362.425v65.709l0.166,1.023l4.528,1.412c34.214,10.699,64.761,15.616,91.292,17.153v-19.837C95.991,384.371,125.054,347.523,164.795,335.714z');
	path_friend.set({fill: 'black',});
	var rect_friend = new fabric.Rect({left: -80,top: -80,width: 680,height: 680, fill: '#2E2E2E', rx: 150, ry:150});
	var rect_friend_sh = new fabric.Rect({left: -40,top: -40,width: 680,height: 680, fill: 'black', rx: 150, ry:150});
	var group_friend = new fabric.Group([rect_friend_sh,rect_friend,path_friend], {
  		left: w*0.605, 
 	 	top: h*0.01
  		});
	group_friend.set('scaleX', (h+w)*0.02/650);
	group_friend.set('scaleY', (h+w)*0.02/650);
	canvas_fon.add(group_friend);

	//massage warning
	var path_warning = new fabric.Path('M512.376,584.192H99.624c-35.959,0-68.162-18.593-86.14-49.732s-17.981-68.325,0-99.467L219.862,77.542c17.978-31.139,50.181-49.732,86.14-49.732s68.162,18.593,86.14,49.732l206.375,357.451c17.981,31.142,17.981,68.325,0,99.467S548.333,584.192,512.376,584.192z M306.002,56.396c-25.625,0-48.571,13.25-61.384,35.439L38.241,449.286c-12.812,22.192-12.81,48.689,0,70.88s35.759,35.439,61.384,35.439h412.749c25.625,0,48.571-13.25,61.384-35.439c12.812-22.189,12.812-48.689,0-70.88L367.383,91.835C354.573,69.643,331.627,56.396,306.002,56.396z M555.493,450.902L356.5,106.234c-10.54-18.258-29.418-29.155-50.498-29.155c-21.083,0-39.961,10.9-50.501,29.155L56.507,450.902c-10.543,18.258-10.54,40.055,0,58.311c10.54,18.255,29.418,29.155,50.501,29.155h397.987c21.083,0,39.961-10.9,50.501-29.155C566.036,490.957,566.033,469.157,555.493,450.902z M269.963,213.788c0-19.87,16.166-36.036,36.036-36.036s36.036,16.166,36.036,36.036v116.947c0,19.871-16.166,36.036-36.036,36.036s-36.036-16.166-36.036-36.036V213.788z M305.999,473.068c-20.362,0-36.928-16.566-36.928-36.928s16.566-36.928,36.928-36.928s36.928,16.566,36.928,36.928S326.361,473.068,305.999,473.068z');
	path_warning.set({fill: '#FFD119', opacity:0.8});
	var group_warning = new fabric.Group([path_warning], {
  		left: w*0.03, 
 	 	top: h*0.01
  		});
	group_warning.set('scaleX', w*0.03/613);
	group_warning.set('scaleY', w*0.03/613);
	canvas_fon.add(group_warning);                

	////////////////////////////

	//create help line
/*	ctx_room.beginPath();
    ctx_room.moveTo(w*0.3, 0);
    ctx_room.lineTo(w*0.3, h);
    ctx_room.moveTo(w*0.7, 0);
    ctx_room.lineTo(w*0.7, h);
    ctx_room.moveTo(0, h*0.2);
    ctx_room.lineTo(w, h*0.2);
    ctx_room.moveTo(0, h*0.8);
    ctx_room.lineTo(w, h*0.8);
    ctx_room.stroke();*/


	/*ctx_room.strokeStyle = "#6BA0FF";
    ctx_room.strokeRect(w*0.71, h*0.02, w*0.28, h*0.46);
    ctx_room.beginPath();
    ctx_room.moveTo(w*0.85, h*0.02);
    ctx_room.lineTo(w*0.85, h*0.48);
    ctx_room.stroke();
    ctx_room.beginPath();
    ctx_room.moveTo(w*0.71, h*0.25);
    ctx_room.lineTo(w*0.99, h*0.25);
    ctx_room.stroke();*/
    ////


    //create circle 

    //fon circle                         //0.0087*(h+w)  ==  25
    function create_circle(){
    ctx_room.beginPath();
	ctx_room.strokeStyle = "#191919";
	ctx_room.lineWidth = 25;

	ctx_room.arc( w*0.85+r_circle, h*0.25-r_circle, r_circle-12.5, 0, Math.PI*2, false);
	ctx_room.stroke();

	ctx_room.beginPath();
	ctx_room.arc( w*0.85+r_circle, h*0.25-r_circle, r_circle-37.5, 0, Math.PI*2, false);
	ctx_room.stroke();

	ctx_room.beginPath();
	ctx_room.lineWidth = 25;
	ctx_room.arc( w*0.85-r_circle, h*0.25+r_circle, r_circle-12.5, 0, Math.PI*2, false);
	ctx_room.stroke();

	//CHANGE DELETE 
	//user_level = 5;

	var degrees1 = (user_level/30)*360;
	var degrees2 = 270;
	var point_profile = 2;
	if(user_name1 != '') point_profile++;
	if(user_name2 != '') point_profile++;
	if(user_place != 0) point_profile++;
	var degrees3 = (point_profile/5)*360;
	//get degree
	var radians1 = degrees1 * Math.PI / 180;
	var radians2 = degrees2 * Math.PI / 180;
	var radians3 = degrees3 * Math.PI / 180;

	//color in circle
	ctx_room.beginPath();
	ctx_room.strokeStyle = "#85335C";
	ctx_room.lineWidth = 25;
	ctx_room.arc(w*0.85+r_circle,  h*0.25-r_circle,r_circle-12.5, 0 - 90*Math.PI/180, radians1 - 90*Math.PI/180, false); 
	ctx_room.stroke();

	ctx_room.beginPath();
	ctx_room.strokeStyle = "#FF5C33";
	ctx_room.lineWidth = 25;
	ctx_room.arc(w*0.85+r_circle, h*0.25-r_circle, r_circle-37.5, 0 - 90*Math.PI/180, radians2 - 90*Math.PI/180, false); 
	ctx_room.stroke();

	ctx_room.beginPath();
	ctx_room.strokeStyle = "#FFE270";
	ctx_room.lineWidth = 25;
	ctx_room.arc(w*0.85-r_circle, h*0.25+r_circle, r_circle-12.5, 0 - 90*Math.PI/180, radians3 - 90*Math.PI/180, false); 
	ctx_room.stroke();

	ctx_room.fillStyle = "#85335C";
	var n_t = ((r_circle-50)*2)*0.323;
	ctx_room.font = n_t + "px arial";
	text = Math.floor(degrees1/360*100) + "%";
	text_width = ctx_room.measureText(text).width;
	ctx_room.fillText(text,w*0.85+r_circle/2 +21, h*0.25-r_circle);
	
	ctx_room.fillStyle = "#FF5C33";
	ctx_room.font = n_t + "px arial";
	text = Math.floor(degrees2/360*100) + "%";
	text_width = ctx_room.measureText(text).width;
	ctx_room.fillText(text,w*0.85+r_circle/2 +21, h*0.25-r_circle+n_t);
  	
	ctx_room.fillStyle = "#FFE270";
	ctx_room.font = n_t;
	text = Math.floor(degrees3/360*100) + "%";
	text_width = ctx_room.measureText(text).width;
	ctx_room.fillText(text, w*0.85-r_circle - (r_circle-27)*2*0.2, h*0.25+r_circle + (r_circle-27)*2*0.4);
	}
	create_circle();
	////////////////

	//add buton on each img of button
	function path_hide(){
		document.getElementById('btn_vkontakte').remove();
		document.getElementById('btn_friend').remove();
		document.getElementById('btn_youTube').remove();
		document.getElementById('btn_expand').remove();
		document.getElementById('btn_music').remove();
		document.getElementById('btn_shop').remove();
		document.getElementById('btn_custom').remove();
		document.getElementById('btn_teor').remove();
		document.getElementById('btn_history').remove();
		document.getElementById('btn_news').remove();
		document.getElementById('btn_site').remove();
		document.getElementById('btn_achive').remove();
		document.getElementById('btn_question').remove();
		document.getElementById('btn_omega').remove();
		document.getElementById('btn_profile').remove();
		document.getElementById('btn_start_level').disabled = true;
	}

	function rehide(){
		document.body.appendChild(btn_vkontakte);
		document.body.appendChild(btn_friend);
		document.body.appendChild(btn_youTube);
		document.body.appendChild(btn_expand);
		document.body.appendChild(btn_music);
		document.body.appendChild(btn_shop);
		document.body.appendChild(btn_custom);
		document.body.appendChild(btn_teor);
		document.body.appendChild(btn_history);
		document.body.appendChild(btn_news);
		document.body.appendChild(btn_site);
		document.body.appendChild(btn_achive);
		document.body.appendChild(btn_question);
		document.body.appendChild(btn_omega);
		document.body.appendChild(btn_profile);
	}


	function c_profile(){
		//create field to change information in the profile
		var style_width = w*0.2;
		var style_height = h*0.05;
		var style_left = w*0.5-(style_width/2);

		var btn_name1 = document.createElement('input');
		btn_name1.id = 'btn_name1';
		btn_name1.className = 's_profile';
		btn_name1.placeholder = 'Имя';
		document.body.appendChild(btn_name1);
		document.getElementById('btn_name1').style.width = style_width + 'px';
		document.getElementById('btn_name1').style.height = style_height + 'px';
		document.getElementById('btn_name1').style.top =  h*0.15 + 'px';
		document.getElementById('btn_name1').style.left = style_left + 'px';
		document.getElementById('btn_name1').style.fontSize = w*0.015 + 'px';
		if(user_name1 != '')
			document.getElementById('btn_name1').value = user_name1;

		var btn_name2 = document.createElement('input');
		btn_name2.id = 'btn_name2';
		btn_name2.className = 's_profile';
		btn_name2.placeholder = 'Фамилия';
		document.body.appendChild(btn_name2);
		document.getElementById('btn_name2').style.width = style_width + 'px';
		document.getElementById('btn_name2').style.height = style_height + 'px';
		document.getElementById('btn_name2').style.top =  h*0.25 + 'px';
		document.getElementById('btn_name2').style.left = style_left + 'px';
		document.getElementById('btn_name2').style.fontSize = w*0.015 + 'px';
		if(user_name2 != '')
			document.getElementById('btn_name2').value = user_name2;

		var btn_pass = document.createElement('input');
		btn_pass.setAttribute("type","password");
		btn_pass.id = 'btn_pass';
		btn_pass.className = 's_profile';
		btn_pass.placeholder = 'Новый пароль';
		document.body.appendChild(btn_pass);
		document.getElementById('btn_pass').style.width = style_width + 'px';
		document.getElementById('btn_pass').style.height = style_height + 'px';
		document.getElementById('btn_pass').style.top =  h*0.35 + 'px';
		document.getElementById('btn_pass').style.left = style_left + 'px';
		document.getElementById('btn_pass').style.fontSize = w*0.015 + 'px';

		var btn_pass_chek = document.createElement('input');
		btn_pass_chek.setAttribute("type","password");
		btn_pass_chek.id = 'btn_pass_chek';
		btn_pass_chek.className = 's_profile';
		btn_pass_chek.placeholder = 'Повтор пароля';
		document.body.appendChild(btn_pass_chek);
		document.getElementById('btn_pass_chek').style.width = style_width + 'px';
		document.getElementById('btn_pass_chek').style.height = style_height + 'px';
		document.getElementById('btn_pass_chek').style.top =  h*0.45 + 'px';
		document.getElementById('btn_pass_chek').style.left = style_left + 'px';
		document.getElementById('btn_pass_chek').style.fontSize = w*0.015 + 'px';


		var checkbox_place = document.createElement('input');
		checkbox_place.type = "checkbox";
		//checkbox_place.value = "1";
		checkbox_place.id = "checkbox_place";
		checkbox_place.className = 's_profile';
		checkbox_place.style.width = w*0.02 + 'px';
		checkbox_place.style.height = w*0.02 + 'px';
		checkbox_place.style.top =  h*0.75 + 'px';
		checkbox_place.style.left = style_left + 'px';
		if(user_send_mail == 1)
			checkbox_place.checked = 'checked';
		document.body.appendChild(checkbox_place);

		ctx_room.fillStyle = "#999999";
		ctx_room.fillText('Получать новости',style_left + w*0.03, h*0.79);

		var radio1 = document.createElement("input");
		radio1.id = 'radio1';
    	radio1.type = "radio";
    	radio1.name = 'radio';
    	radio1.className = 's_profile';
    	radio1.style.left = style_left + 'px';
		radio1.style.top =  h*0.55 + 'px';
		radio1.style.width = w*0.02 + 'px';
		radio1.style.height = w*0.02 + 'px';
		document.body.appendChild(radio1);
		ctx_room.fillText('Учусь в школе',style_left + w*0.03, h*0.59);

		var radio2 = document.createElement("input");
		radio2.id = 'radio2';
    	radio2.type = "radio";
    	radio2.name = 'radio';
    	radio2.className = 's_profile';
    	radio2.style.left = style_left + 'px';
		radio2.style.top =  h*0.61 + 'px';
		radio2.style.width = w*0.02 + 'px';
		radio2.style.height = w*0.02 + 'px';
		document.body.appendChild(radio2);
		ctx_room.fillText('Студент',style_left + w*0.03, h*0.65);

		var radio3 = document.createElement("input");
		radio3.id = 'radio3';
    	radio3.type = "radio";
    	radio3.name = 'radio';
    	radio3.className = 's_profile';
    	radio3.style.left = style_left + 'px';
		radio3.style.top =  h*0.67 + 'px';
		radio3.style.width = w*0.02 + 'px';
		radio3.style.height = w*0.02 + 'px';
		document.body.appendChild(radio3);
		ctx_room.fillText('Работаю',style_left + w*0.03, h*0.71);

		var btn_change_information = document.createElement('button');
		btn_change_information.id = 'btn_change_information';
		document.body.appendChild(btn_change_information);
		document.getElementById('btn_change_information').style.width = style_width + 'px';
		document.getElementById('btn_change_information').style.height = style_height + 'px';
		document.getElementById('btn_change_information').style.top =  h*0.88 + 'px';
		document.getElementById('btn_change_information').style.left = w*0.5 - style_width/2 + 'px';
		document.getElementById('btn_change_information').style.fontSize = w*0.015 + 'px';
		document.getElementById('btn_change_information').innerHTML = 'Сохранить изменения'
		document.getElementById('btn_change_information').onclick = function(){}
		////
	}

	function create_window(left_cw,top_cw,width_cw,hight_cw,header_cw,k){

		fabric.Image.fromURL('img/fon_profile.png', function(img){
    img.scaleToWidth(300);
    var patternSourceCanvas = new fabric.StaticCanvas();
    patternSourceCanvas.add(img);
    var pattern = new fabric.Pattern({
      source: function() {
        patternSourceCanvas.setDimensions({
          width: img.getWidth(),
          height: img.getHeight()
        });
        return patternSourceCanvas.getElement();
      },
      repeat: 'repeat'
    });
    var rectf = new fabric.Rect({left: left_cw,top: top_cw, fill: '#474747',width: width_cw, height: hight_cw, stroke: '#242424',strokeWidth: 2, fill: pattern});
	var rectf2 = new fabric.Rect({left: left_cw,top: top_cw, fill: '#474747',width: width_cw, height: h*0.05, stroke: '#242424',strokeWidth: 2, fill: '#1A1A1A'});
	var rectf3 = new fabric.Rect({left: left_cw + width_cw - h*0.05,top: top_cw, fill: '#474747',width: h*0.05, height: h*0.05, stroke: '#242424',strokeWidth: 0, fill: 'lightgrey'});
	var path_f = new fabric.Path('M55.931,47.463L94.306,9.09c0.826-0.827,0.826-2.167,0-2.994L88.833,0.62C88.436,0.224,87.896,0,87.335,0   c-0.562,0-1.101,0.224-1.498,0.62L47.463,38.994L9.089,0.62c-0.795-0.795-2.202-0.794-2.995,0L0.622,6.096   c-0.827,0.827-0.827,2.167,0,2.994l38.374,38.373L0.622,85.836c-0.827,0.827-0.827,2.167,0,2.994l5.473,5.476   c0.397,0.396,0.936,0.62,1.498,0.62s1.1-0.224,1.497-0.62l38.374-38.374l38.374,38.374c0.397,0.396,0.937,0.62,1.498,0.62   s1.101-0.224,1.498-0.62l5.473-5.476c0.826-0.827,0.826-2.167,0-2.994L55.931,47.463z');
	path_f.scale(h*0.04/95);
	path_f.set('fill', '#242424');
	path_f.set('left', left_cw + width_cw - h*0.045);
	path_f.set('top', top_cw + h*0.005);
	var text_f = new fabric.Text(header_cw, { fontFamily: 'Impact', left: left_cw + h*0.005, top: top_cw + h*0.005, fontSize: h*0.04, fill: 'grey'});

	canvas_fon.add(rectf,rectf2,rectf3,path_f,text_f);
	if(k!=8)
		create_circle();
	if(header_cw == 'Профиль'){
		c_profile();
	}
	var btn_close = document.createElement('button');
	btn_close.id = 'btn_close';
	document.body.appendChild(btn_close);
	document.getElementById('btn_close').style.visibility = 'true';
	document.getElementById('btn_close').style.width = h*0.05 + 'px';
	document.getElementById('btn_close').style.height = h*0.05 + 'px';
	document.getElementById('btn_close').style.top =  top_cw   + 'px';
	document.getElementById('btn_close').style.left = left_cw + width_cw - h*0.05 + 'px';
	document.getElementById('btn_close').onclick = function(){

		canvas_fon.remove(rectf,rectf2,rectf3,path_f,text_f);
		rehide();
		document.getElementById('btn_start_level').disabled = false;
		if(header_cw == 'Профиль'){
			document.getElementById('btn_name1').remove();
			document.getElementById('btn_name2').remove();
			document.getElementById('btn_pass').remove();
			document.getElementById('btn_pass_chek').remove();
			document.getElementById('checkbox_place').remove();
			document.getElementById('radio1').remove();
			document.getElementById('radio2').remove();
			document.getElementById('radio3').remove();
			document.getElementById('btn_change_information').remove();
		}
		if(header_cw == 'Достижения'){
			document.getElementById('page').innerHTML = '';
		}
		create_circle();
	}

    });

	path_hide();

	//
	}
	//create button on person circle
	var btn_profile = document.createElement('button');
	btn_profile.id = 'btn_profile';
	document.body.appendChild(btn_profile);
	document.getElementById('btn_profile').style.width = (r_circle - 25)*2 + 'px';
	document.getElementById('btn_profile').style.height = (r_circle - 25)*2 + 'px';
	document.getElementById('btn_profile').style.top =  h*0.25+r_circle - r_circle-14.8 + 'px';
	document.getElementById('btn_profile').style.left = w*0.85-r_circle - r_circle-14.8 + 'px';
	document.getElementById('btn_profile').style.fontSize = ((r_circle - 25)*2)*0.0946 + 'pt';
	document.getElementById('btn_profile').textContent = '';
	document.getElementById('btn_profile').onclick = function(){
		//create fon for window
		create_window(w*0.3,0,w*0.4,h,'Профиль');
	}

	var sostoinie = 0;
	var btn_question = document.createElement('button');
	btn_question.id = 'btn_question';
	document.body.appendChild(btn_question);
	document.getElementById('btn_question').style.width = (r_circle*0.3)*2 + 'px';
	document.getElementById('btn_question').style.height = (r_circle*0.3)*2 + 'px';
	document.getElementById('btn_question').style.top =  h*0.25+r_circle*1.7 - r_circle*0.3   + 'px';
	document.getElementById('btn_question').style.left = w*0.85 + 'px';
	document.getElementById('btn_question').onclick = function(){
		if(sostoinie==0){
		sostoinie = 1;
    	var i_help_fon = new fabric.Image.fromURL('img/help_fon.svg', function(img){
    	img.set('width', w);
    	img.set('height', h);
    	canvas_fon.add(img);
    	create_circle();
    	document.getElementById('btn_question').onmouseout = function(){
    		canvas_fon.remove(img);
    		sostoinie = 0; 
    		create_circle();}});
    }
	}
	

	
	var btn_achive = document.createElement('button');
	btn_achive.id = 'btn_achive';
	document.body.appendChild(btn_achive);
	document.getElementById('btn_achive').style.width = (r_circle*0.75)*2 + 'px';
	document.getElementById('btn_achive').style.height = (r_circle*0.75)*2 + 'px';
	document.getElementById('btn_achive').style.top =  h*0.25+r_circle - r_circle*0.7 + 'px';
	document.getElementById('btn_achive').style.left = w*0.85+r_circle*1.3 - r_circle*0.7 + 'px';
	document.getElementById('btn_achive').onclick = function(){
		create_window(0,h*0.2,w*0.7,h*0.8,'Достижения');
		document.getElementById('page').style.top = h*0.25 + 'px';
		document.getElementById('page').style.width = w*0.7 + 'px';
		document.getElementById('page').style.height = w*0.75 + 'px';
		document.getElementById('page').innerHTML = '<table height="100%" width="100%" cellspacing="0" cellpadding="5"><tr> <td width="45%" valign="top"  ><div align="center" height="100%" id = "cetrificat_blur"><p align="center" >\n\n\n\n\n\nДля получения сертификата\nнеобходимо пройти весь курс обучения</p></div><div align="center" id = "cetrificat" ><img id = "img_sertificat"  src="img/certificat.png" width="68%  height="100%" align="center" alt="Сертификат"></div><div id = "progres_bar_fon"><div id = "progres_bar"><p style="color: #292929">38%</p></div></div><div id = "opicanie" align="center"><button id="get_cretificat" width="100%">Получить сертификат</button></div></td><td valign="top">Правая колонка</td></tr></table>';
		document.getElementById('progres_bar').style.width = '38%';
	}

	var btn_site = document.createElement('button');
	btn_site.id = 'btn_site';
	document.body.appendChild(btn_site);
	document.getElementById('btn_site').style.width = (r_circle*0.8)*2 + 'px';
	document.getElementById('btn_site').style.height = (r_circle*0.8)*2 + 'px';
	document.getElementById('btn_site').style.top =  h*0.25-r_circle*1.25 - r_circle*0.75 + 'px';
	document.getElementById('btn_site').style.left = w*0.85-r_circle*1.25 - r_circle*0.75 + 'px';

	var btn_vkontakte = document.createElement('button');
	btn_vkontakte.id = 'btn_vkontakte';
	document.body.appendChild(btn_vkontakte);
	document.getElementById('btn_vkontakte').style.width = (h+w)*0.02 + 'px';
	document.getElementById('btn_vkontakte').style.height = (h+w)*0.02 + 'px';
	document.getElementById('btn_vkontakte').style.top =  h*0.01 + 'px';
	document.getElementById('btn_vkontakte').style.left = w*0.55 + 'px';
	document.getElementById('btn_vkontakte').onclick = function(){
		window.open('https://vk.com/public100887907');}

	var btn_friend = document.createElement('button');
	btn_friend.id = 'btn_friend';
	document.body.appendChild(btn_friend);
	document.getElementById('btn_friend').style.width = (h+w)*0.021 + 'px';
	document.getElementById('btn_friend').style.height = (h+w)*0.021 + 'px';
	document.getElementById('btn_friend').style.top =  h*0.01 + 'px';
	document.getElementById('btn_friend').style.left = w*0.605 + 'px';

	var btn_youTube = document.createElement('button');
	btn_youTube.id = 'btn_youTube';
	document.body.appendChild(btn_youTube);
	document.getElementById('btn_youTube').style.width = (h+w)*0.02 + 'px';
	document.getElementById('btn_youTube').style.height = (h+w)*0.02 + 'px';
	document.getElementById('btn_youTube').style.top =  h*0.01 + 'px';
	document.getElementById('btn_youTube').style.left = w*0.6585 + 'px';
	document.getElementById('btn_youTube').onclick = function(){
		window.open('https://www.youtube.com/channel/UCsG-EfU5XelnVoJ70unHX_Q');}

	//function for fullscreen
	/*function requestFullScreen(element) {
    var requestMethod = element.requestFullScreen || element.webkitRequestFullScreen || element.mozRequestFullScreen || element.msRequestFullscreen;
    if (requestMethod) {
        requestMethod.call(element);
    } else if (typeof window.ActiveXObject !== "undefined") { // для IE
        var wscript = new ActiveXObject("WScript.Shell");
        if (wscript !== null) {
            wscript.SendKeys("{F11}");}}}*/
    ////////////////////////       
	var btn_expand = document.createElement('button');
	btn_expand.id = 'btn_expand';
	document.body.appendChild(btn_expand);
	document.getElementById('btn_expand').style.width = w*0.036 + 'px';
	document.getElementById('btn_expand').style.height = w*0.036 + 'px';
	document.getElementById('btn_expand').style.top =  h*0.805 + 'px';
	document.getElementById('btn_expand').style.left = w*0.658 + 'px';
	document.getElementById('btn_expand').onclick = function(){};

	var btn_music = document.createElement('button');
	btn_music.id = 'btn_music';
	document.body.appendChild(btn_music);
	document.getElementById('btn_music').style.width = w*0.036 + 'px';
	document.getElementById('btn_music').style.height = w*0.036 + 'px';
	document.getElementById('btn_music').style.top =  h*0.805 + 'px';
	document.getElementById('btn_music').style.left = w*0.615 + 'px';

	var btn_shop = document.createElement('button');
	btn_shop.id = 'btn_shop';
	document.body.appendChild(btn_shop);
	document.getElementById('btn_shop').style.width = w*0.0503 + 'px';
	document.getElementById('btn_shop').style.height = w*0.036 + 'px';
	document.getElementById('btn_shop').style.top =  h*0.805 + 'px';
	document.getElementById('btn_shop').style.left = w*0.305 + 'px';
	document.getElementById('btn_shop').onclick = function(){create_window(0,0,w*0.7,h,'Магазин');}

	var btn_custom = document.createElement('button');
	btn_custom.id = 'btn_custom';
	document.body.appendChild(btn_custom);
	document.getElementById('btn_custom').style.width = w*0.0503 + 'px';
	document.getElementById('btn_custom').style.height = w*0.036 + 'px';
	document.getElementById('btn_custom').style.top =  h*0.805 + 'px';
	document.getElementById('btn_custom').style.left = w*0.365 + 'px';
	document.getElementById('btn_custom').onclick = function(){create_window(w*0.3,h*0.2,w*0.4,h*0.6,'Кастомизация');}

	var btn_omega = document.createElement('button');
	btn_omega.id = 'btn_omega';
	document.body.appendChild(btn_omega);
	document.getElementById('btn_omega').style.width = w*0.075 + 'px';
	document.getElementById('btn_omega').style.height = w*0.062 + 'px';
	document.getElementById('btn_omega').style.top =  h*0.55 + 'px';
	document.getElementById('btn_omega').style.left = w*0.72 + 'px';
	document.getElementById('btn_omega').onclick = function(){
		path_hide();
		document.getElementById('btn_start_level').remove();
		var rect_for_omega = new fabric.Rect({left: 0,top: 0, fill: 'black',width: w, height: h, opacity: 0.8});
		canvas_fon.add(rect_for_omega);
		var i_omega_problem = new fabric.Image.fromURL('img/omega_problem.svg', function(img){
    	img.set('width', w*0.8);
    	img.set('height', h*0.85);
    	img.set('left', w*0.1);
    	img.set('top', h*0.075);
    	canvas_fon.add(img);

    	var textarea_omega = document.createElement("textarea");
    	textarea_omega.id = 'textarea_omega';
    	textarea_omega.style.width = w*0.668 + 'px';
		textarea_omega.style.height = h*0.523 + 'px';
		textarea_omega.style.top =  h*0.2 + 'px';
		textarea_omega.style.left = w*0.126 + 'px';
		textarea_omega.autofocus = 'true';
		textarea_omega.wrap="off";
		textarea_omega.maxLength = 6000;
		textarea_omega.value = '#include<iostrem>\n\nint main(){\n}'
		document.body.appendChild(textarea_omega);

		//h*0.211
		var btn_omega_send = document.createElement('button');
		btn_omega_send.id = 'btn_omega_send';
		document.body.appendChild(btn_omega_send);
		document.getElementById('btn_omega_send').style.width = w*0.08 + 'px';
		document.getElementById('btn_omega_send').style.height = h*0.146 + 'px';
		document.getElementById('btn_omega_send').style.top =  h*0.715 + 'px';
		document.getElementById('btn_omega_send').style.left = w*0.8112 + 'px';
		document.getElementById('btn_omega_send').onclick = function(){
		}

    	var btn_omega_close = document.createElement('button');
		btn_omega_close.id = 'btn_omega_close';
		document.body.appendChild(btn_omega_close);
		document.getElementById('btn_omega_close').style.width = w*0.1 + 'px';
		document.getElementById('btn_omega_close').style.height = h*0.102 + 'px';
		document.getElementById('btn_omega_close').style.top =  h*0.1 + 'px';
		document.getElementById('btn_omega_close').style.left = w*0.8 + 'px';
		document.getElementById('btn_omega_close').onclick = function(){
			document.getElementById('btn_omega_close').remove();
			document.getElementById('btn_omega_send').remove();
			document.getElementById('textarea_omega').remove();
			canvas_fon.remove(rect_for_omega,img);
			create_circle();
			document.body.appendChild(btn_start_level);
			rehide();
		}

    	});
	}


	var btn_teor = document.createElement('button');
	btn_teor.id = 'btn_teor';
	document.body.appendChild(btn_teor);
	document.getElementById('btn_teor').style.width = w*0.2 + 'px';
	document.getElementById('btn_teor').style.height = h*0.15 + 'px';
	document.getElementById('btn_teor').style.top =  h*0.21 + 'px';
	document.getElementById('btn_teor').style.left = -1 + 'px';
	document.getElementById('btn_teor').onclick = function(){create_window(w*0.3,0,w*0.7,h,'Теория',8);}

	var btn_history = document.createElement('button');
	btn_history.id = 'btn_history';
	document.body.appendChild(btn_history);
	document.getElementById('btn_history').style.width = w*0.2 + 'px';
	document.getElementById('btn_history').style.height = h*0.15 + 'px';
	document.getElementById('btn_history').style.top =  h*0.4 + 'px';
	document.getElementById('btn_history').style.left = -1 + 'px';
	document.getElementById('btn_history').onclick = function(){create_window(w*0.3,0,w*0.7,h,'История',8);}

	var btn_news = document.createElement('button');
	btn_news.id = 'btn_news';
	document.body.appendChild(btn_news);
	document.getElementById('btn_news').style.width = w*0.2 + 'px';
	document.getElementById('btn_news').style.height = h*0.15 + 'px';
	document.getElementById('btn_news').style.top =  h*0.59 + 'px';
	document.getElementById('btn_news').style.left = -1 + 'px';
	document.getElementById('btn_news').onclick = function(){create_window(w*0.3,0,w*0.7,h,'Новости галактики',8);}

	var btn_start_level = document.createElement('button');
	btn_start_level.id = 'btn_start_level';
	document.body.appendChild(btn_start_level);
	document.getElementById('btn_start_level').style.width = w*0.13 + 'px';
	document.getElementById('btn_start_level').style.height = h*0.06 + 'px';
	document.getElementById('btn_start_level').style.top =  h*0.492 + 'px';
	document.getElementById('btn_start_level').style.left = w*0.87 + 'px';
	document.getElementById('btn_start_level').style.fontSize = w*0.015+'px';
	document.getElementById('btn_start_level').innerHTML = 'Продолжить';
	document.getElementById('btn_start_level').onclick = function(){alert('load level')}

	/*var btn_start_help = document.createElement('button');
	btn_start_help.id = 'btn_start_help';
	document.body.appendChild(btn_start_help);
	document.getElementById('btn_start_help').style.width = w*0.13 + 'px';
	document.getElementById('btn_start_help').style.height = h*0.08 + 'px';
	document.getElementById('btn_start_help').style.top =  h*0.58 + 'px';
	document.getElementById('btn_start_help').style.left = w - w*0.13 + 'px';
	document.getElementById('btn_start_help').style.fontSize = w*0.012+'px';
	document.getElementById('btn_start_help').innerHTML = 'помощь силам\nсопротивления';
	document.getElementById('btn_start_help').onclick = function(){}*/

	/////////////////////////////////

	var level_box_width = (w*0.4)/15;
	var level_box_height = (h*0.6)/15;



	//create user - level - button
	if(user_level == 0){
		var rect_l_1 = new fabric.Rect({left: w*0.3+ 7*level_box_width,top: h*0.2 + 7*level_box_height, rx: 0, ry: 0, fill: '#666666',width: level_box_width, height: level_box_height});
		canvas_fon.add(rect_l_1);
	}
	create_circle();


	if(after_rigist == 1){

		document.getElementById('btn_start_level').innerHTML = 'Начать';
		document.getElementById('btn_start_level').remove();
		///
		setTimeout(function(){

			var rect_for_question = new fabric.Rect({left: 0,top: 0,width: w,height: h, fill: 'black', opacity:0.8});
			canvas_fon.add(rect_for_question,group_question);
			var l = 0;
			document.getElementById('btn_question').onmouseover = function(){
				canvas_fon.remove(rect_for_question);
				create_circle();
				l++;
				document.body.appendChild(btn_start_level);
				document.body.appendChild(btn_start_help);
			}

            var rect = new fabric.Rect({fill: 'black',width: w*0.6,height: h*0.148, opacity: 0.8, rx: 10, ry: 10,});
            var text = new fabric.Text(' – Здесь работал над своими проектами создатель,\nчувствуй себя как дома. Спрашивай, если что то не найдешь.', {fontSize: w*0.02, left: 20, top: 20, fill: '#66FFCC', fontStyle: "bold", opacity: 0.7});
            var group_t1 = new fabric.Group([rect, text], {left: w*0.08, top: h*0.75, opacity: 0});
            canvas_fon.add(group_t1); 

            group_t1.animate('opacity', 0.9, { duration: 1000, onChange: canvas_fon.renderAll.bind(canvas_fon), onComplete: function(){
                setTimeout(function() {
                   canvas_fon.remove(group_t1);
                   if(l==1)
                   	 create_circle();
				}, 6000);}});

        } , 700)
        ////

	}
/*	
	//create line with description
	ctx_room.beginPath();
    ctx_room.moveTo(W-70, H-70);
    ctx_room.lineTo(W-100, H-100);
    ctx_room.lineTo(W-250-64, H-100);
    ctx_room.moveTo(W-40-15, H-40);
    ctx_room.lineTo(W-70-15, H-70);
    ctx_room.lineTo(W-250-64, H-70);
    ctx_room.moveTo(W-70, H-70+260);
    ctx_room.lineTo(W-100, H-100+260);
    ctx_room.lineTo(W-250-64, H-100+260);
    ctx_room.lineWidth = 2; // толщина линии
    ctx_room.strokeStyle = "#666666"; // цвет линии
    ctx_room.stroke();
    
    //create text on line
    ctx_room.fillStyle = "#B2B2B2";
    ctx_room.font = "15pt Arial";
    ctx_room.font = 'bold 15px sans-serif';
    ctx_room.textBaseline = "bottom";
    ctx_room.fillText("Прогресс прохождения курса",W-250-64,H-100);
    ctx_room.fillText("Очки противостояния",W-250-64,H-70);
    ctx_room.fillText("Информации в профиле",W-250-64,H-100+260);*/

	
  }
}


